coright/CMSIS-DAP/source/bootloader/hal/freescale/mk20dx128/device_cfg.h
/* CMSIS-DAP Interface Firmware
 * Copyright (c) 2009-2013 ARM Limited
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
 
#ifndef DEVICE_CFG_H
#define DEVICE_CFG_H

#include "MK20D5.h"

/**
 This file is for the Freescale MK20DX bootloader
 Each device (bootloader) or target (CMSIS-DAP app)
 Should have a file that defines the following
 */
 
 /**
  @addtogroup
  @{
 */
 
struct flash_desc_t  {
    uint32_t sector_size;
    uint32_t sector_address;
};
 
typedef struct fw_conf_t fw_conf_t;
__packed struct fw_conf_t {
    uint8_t     board_id[4];
    uint8_t     secret[8];
    uint32_t    sector_size;
    uint32_t    sector_cnt;
    uint32_t    flash_start;
    uint32_t    flash_end;
    uint32_t    ram_start;
    uint32_t    ram_end;
    struct flash_desc_t sectors[];
};

/*!< BOARD_ID is an unique identifier for the bootloader or CMSIS-DAP application */
#define BOARD_ID            "ffff"

/*!< BOARD_SECRET is mangaged by mbed.org To request a BOARD_SECRET email support@mbed.org Do not version this */
#define BOARD_SECRET        "00000000"

/*!< SECTOR_SIZE is the number of bytes in a sector used by flash erase and write and usb_buffer sizing */
#define FLASH_SECTOR_SIZE   0x400

/*!< APP_START_ADR is the execution address for an application */
#define APP_START_ADR       0x8000

/*!< NUM_OF_SECTORS is the integer representation of sectors in flash. Devices with multiple sizes should
        implement SECTOR_SIZE_A, SECTOR_SIZE_B etc and generate accordingly */
#define NUM_OF_SECTORS      (128)

/*!< FLASH_SIZE_KB is the size of flash for a given application */
#define FLASH_SIZE_KB       (NUM_OF_SECTORS-(APP_START_ADR/FLASH_SECTOR_SIZE))

/*!< START_FLASH is the lowest ROM address executable code can be placed. Usually after the NVIC table 
        and is used to validate an image by looking at the NVIC entries */
#define START_FLASH	        0x410

/*!< END_FLASH used to verify images in the NVIC table. Calculate accordingly if multiple sector sizes exist */
#define END_FLASH           (FLASH_SIZE_KB*FLASH_SECTOR_SIZE)

/*!< START_RAM used to verify images in the NVIC table */
#define START_RAM           0x1FFFE000

/*!< END_RAM used to verify images in the NVIC table */
#define END_RAM	            0x20002000

/*!< INITIAL_SP used to verify images in the NVIC table of the CMSIS-DAP debug application */
#define INITIAL_SP      (*(uint32_t *)(APP_START_ADR))
#define RESET_HANDLER   (*(uint32_t *)(APP_START_ADR + 4))

/**
 @}
 */

#endif
